### Data merge

In [4]:
import pandas as pd

# Example datasets for data merging
# Dataset 1: Pakistani Individuals
data1 = {
    'id': [1, 2, 3],
    'name': ['John', 'Mathew', 'Adam'],
    'age': [28, 32, 24]
}
df1 = pd.DataFrame(data1)
df1.head()

   id    name  age
0   1    John   28
1   2  Mathew   32
2   3    Adam   24

In [7]:
# Dataset 2: Additional Information
data2 = {
    'id': [1, 2, 3],
    'city': ['New York', 'London', 'Paris'],
    'occupation': ['Engineer', 'Doctor', 'Teacher']
}
df2 = pd.DataFrame(data2)
df2.head()

   id      city occupation
0   1  New York   Engineer
1   2    London     Doctor
2   3     Paris    Teacher

In [8]:
# Merging DataFrames on 'id'
merged_df = pd.merge(df1, df2, on='id', how='inner')
merged_df.head()

   id    name  age      city occupation
0   1    John   28  New York   Engineer
1   2  Mathew   32    London     Doctor
2   3    Adam   24     Paris    Teacher

###  Concatenation

In [11]:
import pandas as pd

# Example datasets for USA context
# Dataset 1 - American Names and Ages
data1 = {'Name': ['John', 'Emma', 'Michael'], 'Age': [28, 32, 24]}
# Dataset 2 - More American Names and Ages
data2 = {'Name': ['Sophia', 'James', 'Olivia'], 'Age': [29, 35, 27]}
# Dataset 3 - Cities and States in the USA
data3 = {'City': ['New York', 'Los Angeles', 'Chicago'], 'State': ['New York', 'California', 'Illinois']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

# Concatenating Rows
concatenated_rows = pd.concat([df1, df2])

# Concatenating Columns
# Note: For a meaningful column-wise concatenation, dataframes should have the same number of rows.
concatenated_columns = pd.concat([df1, df3], axis=1)

print(concatenated_rows)
print(";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;")
print(concatenated_columns)

      Name  Age
0     John   28
1     Emma   32
2  Michael   24
0   Sophia   29
1    James   35
2   Olivia   27
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
      Name  Age         City       State
0     John   28     New York    New York
1     Emma   32  Los Angeles  California
2  Michael   24      Chicago    Illinois